#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Reading...
module.fourkeys.module.gcloud_build_batch_logs_bq_writer.data.external.env_override[0]: Reading...
module.fourkeys.module.gcloud_build_batch_logs_bq_writer.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.data.archive_file.gh_logs_bq_writer_source: Reading...
module.fourkeys.data.archive_file.events_bq_writer_source: Reading...
module.fourkeys.data.archive_file.events_bq_writer_source: Read complete after 0s [id=6f2d6c347b7f4e8eba5d12946eda38b1d84b2af7]
module.fourkeys.data.archive_file.gh_logs_bq_writer_source: Read complete after 0s [id=6c1bb5ba27bd83aabb22cffba9470a9ca91073b6]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_destroy_command[0]: Refreshing state... [id=7501264970071068882]
module.fourkeys.module.gcloud_build_batch_logs_bq_writer.null_resource.run_command[0]: Refreshing state... [id=5738257688551693195]
module.fourkeys.module.gcloud_build_batch_logs_bq_writer.null_resource.run_destroy_command[0]: Refreshing state... [id=4247865089283958810]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_command[0]: Refreshing state... [id=2671861280509006243]
module.fourkeys.google_cloud_run_service_iam_binding.event_handler_noauth: Refreshing state... [id=v1/projects/off-net-dev/locations/northamerica-northeast1/services/batch-events-bq-writer/roles/run.invoker]
module.fourkeys.google_storage_bucket.events_station_local: Refreshing state... [id=off-net-dev-events-station-local]
module.fourkeys.google_storage_bucket.events_archieve_local: Refreshing state... [id=off-net-dev-events-archieve-local]
module.fourkeys.google_storage_bucket.gh_audit_log_archieve_local: Refreshing state... [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.data.google_project.project: Reading...
module.fourkeys.google_bigquery_dataset.dataset: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys]
module.fourkeys.google_cloud_run_service.batch_logs_bq_writer: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer]
module.fourkeys.google_storage_bucket.gh_audit_log_station_local: Refreshing state... [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.google_cloud_run_service.batch_events_bq_writer: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer]
module.fourkeys.google_eventarc_trigger.gh_logs_trigger: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/gh-logs-trigger]
module.fourkeys.google_eventarc_trigger.primary: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/name]
module.fourkeys.google_bigquery_table.batch_logs: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_logs]
module.fourkeys.google_bigquery_table.batch_events: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_events]
module.fourkeys.data.google_project.project: Read complete after 0s [id=projects/off-net-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.fourkeys.google_cloud_run_service.batch_events_bq_writer will be updated in-place
  ~ resource "google_cloud_run_service" "batch_events_bq_writer" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer"
        name                       = "batch-events-bq-writer"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_cloud_run_service.batch_logs_bq_writer will be updated in-place
  ~ resource "google_cloud_run_service" "batch_logs_bq_writer" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer"
        name                       = "batch-logs-bq-writer"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_cloud_run_service_iam_binding.event_handler_noauth will be destroyed
  # (because google_cloud_run_service_iam_binding.event_handler_noauth is not in configuration)
  - resource "google_cloud_run_service_iam_binding" "event_handler_noauth" {
      - etag     = "BwYR01R79+s=" -> null
      - id       = "v1/projects/off-net-dev/locations/northamerica-northeast1/services/batch-events-bq-writer/roles/run.invoker" -> null
      - location = "northamerica-northeast1" -> null
      - members  = [
          - "allUsers",
        ] -> null
      - project  = "off-net-dev" -> null
      - role     = "roles/run.invoker" -> null
      - service  = "v1/projects/off-net-dev/locations/northamerica-northeast1/services/batch-events-bq-writer" -> null
    }

  # module.fourkeys.google_storage_transfer_job.batch_events_transfer_job will be created
  + resource "google_storage_transfer_job" "batch_events_transfer_job" {
      + creation_time          = (known after apply)
      + deletion_time          = (known after apply)
      + description            = "This will transfer GitHub events in archive bucket every hour"
      + id                     = (known after apply)
      + last_modification_time = (known after apply)
      + name                   = (known after apply)
      + project                = "off-net-dev"
      + status                 = "ENABLED"

      + schedule {
          + repeat_interval = "3600s"

          + schedule_start_date {
              + day   = 21
              + month = 2
              + year  = 2024
            }
        }

      + transfer_spec {
          + sink_agent_pool_name   = (known after apply)
          + source_agent_pool_name = (known after apply)

          + gcs_data_sink {
              + bucket_name = "off-net-dev-events-archive-local"
              + path        = (known after apply)
            }

          + gcs_data_source {
              + bucket_name = "off-net-dev-events-station-local"
              + path        = "webhook-event/github/"
            }
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*